# Задача 1. Улучшенная лингвистика 2
#
# Усовершенствуйте старую программу:
#
# У нас есть список из трёх слов, которые вводит пользователь. Затем вводится сам текст произведения,
# который вводится уже в одну строку. Напишите программу, которая посчитает, сколько раз слова пользователя встречаются в тексте.
#
#
#

words = [input("Введите слово: ") for _ in range(3)]
text = input("Введите текст: ")
words_count = [text.count(word) for word in words]

print(words_count)

# Задача 2. Бабушка
#
# У одной бабушки, когда та переписывается с внуком, постоянно залипает кнопка пробела.
# В итоге между словами получаются огромные расстояния.
# Внук не знает как это поправить в самом телефоне, поэтому обратился к вам за помощью.
#
# Пользователь вводит строку. Напишите программу, которая преобразовывает
# в этой строке все идущие подряд пробелы в один и выводит результат на экран.
#
#
#
# Пример:
#
# Введите текст: У       нас         пошёл                    снег    !
#
#
#
# Исправленный текст: У нас пошёл снег !
#
#
#

text = input("Введите текст: ")
print(" ".join(text.split()))

# Задача 3. Разделители символов
#
# Человек хочет сделать рассылку поздравлений для определённого списка людей. Поздравления для разных людей он хочет написать по-разному.
#
#
#
# Напишите программу, которая запрашивает у пользователя:
#
# Шаблон поздравления (туда вставляется ФИ и возраст)
#
# ФИ людей (в одну строку, разделяются запятой)
#
# Возраст каждого человека (в одну строку через пробел)
#
# В конце  программа выводит поздравления и всех именинников в одну строку вместе с их возрастом.
#
#
#
# Пример:
#
# Введите шаблон поздравления, в шаблоне можно использовать конструкцию {name} и {age}: С днём рождения, {name}! С {age}-летием тебя!
#
# Список людей через запятую: Иван Иванов, Петя Петров, Лена Ленова
#
# Возраст людей через пробел: 20 30 18
#
#
#




while True:
    grats_template = input("Введите шаблон поздравления, "
                           "в шаблоне можно использовать конструкцию {name} и {age}: "
                           "С днём рождения, {name}! С {age}-летием тебя! ")
    if "{name}" in grats_template and "{age}" in grats_template:
        break
    print("Ошибка! Отсутствует одна или несколько конструкций!")

names_list = input("Введите список людей через запятую: ").split(",")
# если ввод только через запятую то пробел не добавялем, если с пробелом то - .split(", ")
ages_str = input("Введите возраст людей через пробел: ")
ages = [int(age) for age in ages_str.split()]

for i_man in range(len(names_list)):
    print(grats_template.format(name=names_list[i_man], age=ages[i_man]))

for index, name in enumerate(names_list):
    print(grats_template.format(name=name, age=ages[index]))

# Вариант с небольшой долей "магии" (инструмент будет изучен в будущих модулях):
for age, name in zip(ages, names_list):  # zip соединяет списки и можно брать сразу по элементу из каждого
    print(grats_template.format(name=name, age=age))

people = [" ".join([names_list[index], str(ages[index])]) for index in range(len(names_list))]
print("Именинники:", ", ".join(people))

