# Задача 1. Таблица умножения: возвращение
#
# Математик Паша постепенно начал становиться программистом Пашей, правда  интернет ему не оплатили, а компьютер настолько древний,
# что просто не тянет никакие среды разработки. Поэтому он начал разбираться, как можно писать программы,
# используя только возможности операционной системы.
#
# Напишите простую программу, которая выводит на экран таблицу умножения. Используйте только консоль и текстовый редактор.
#
#
#

for i in range(1, 10):
    for j in range(1, 10):
        print(i * j, end='\t')
    print()

# Задача 2. Калькулятор
#
# Напишите программу калькулятор. Пользователь вводит два числа A и B и действие X (плюс, минус, умножить, разделить).
# Программа выводит результат в виде A X B = C, где C — результат этого действия над числами A и B.
# Используйте только консоль и текстовый редактор. Обеспечьте контроль ввода.
#
#
#
# Пример работы программы в консоли:
#
# Выберите операцию: +
#
# Введите первое число: 5
#
# Введите второе число: 6
#
#
#
# 5 + 6 = 11
#
#
#
# Пример работы программы в консоли 2:
#
# Выберите операцию: №
#
# Ошибка: такой операции не существует. Попробуйте ещё раз.
#
# Выберите операцию: -
#
# Введите первое число: 5
#
# Введите второе число: 6
#
#
#
# 5 - 6 = -1
#
#
#

while True:
    command = input("Выберите операцию: ")
    if command in "+-*/":
        break
    print("Ошибка: такой операции не существует. Попробуйте ещё раз.")

first = int(input("Введите первое число: "))
second = int(input("Введите второе число: "))

result = 0
if command == "+":
    result = first + second
elif command == "-":
    result = first - second
elif command == "*":
    result = first * second
elif command == "/":
    result = first / second

print(first, command, second, '=', result)


# Задача 3. Калькулятор 2
#
# Модифицируйте программу калькулятор из задачи 2 таким образом, чтобы пользователь мог вводить не два числа, а сколько он хочет.
# Теперь программа должна спрашивать действие и количество операндов (то есть чисел).
# После этого пользователь вводит то количество чисел, которое он заказал. Используйте только консоль и текстовый редактор.
#
#
#
# Пример работы программы в консоли:
#
# Выберите операцию: +
#
# Сколько операндов? 4
#
# Введите операнд 1: 6
#
# Введите операнд 2: 43
#
# Введите операнд 3: 11
#
# Введите операнд 4: 0
#
#
#
# 6 + 43 + 11 + 0 = 60

while True:
    command = input("Выберите операцию: ")
    if command in "+-*/":
        break
    print("Ошибка: такой операции не существует. Попробуйте ещё раз.")

count = 1
number = int(input(f"Введите число {count}: "))
result_str = str(number)
result = number
while number != 0:
    count += 1
    number = int(input(f"Введите число {count}: "))

    if number != 0:
        if command == "+":
            result += number
        elif command == "-":
            result -= number
        elif command == "*":
            result *= number
        elif command == "/":
            result /= number
    result_str += " " + command + " " + str(number)

print(result_str + " = " + str(result))
